# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

number = int(input("Введите трехзначное число:"))

n1 = number//100
print(n1)

n2 = (number//10)%10
print(n2)

n3 = number%10
print(n3)

print(f"{number} -> {n1+n2+n3} ({n1} + {n2} + {n3})")
